arendst/Tasmota/lib/lib_div/IRMP-3.4.0/examples/OneProtocol/ATtinySerialOut.cpp
void writeChar(uint8_t aChar) {
    writeBinary(aChar);
}

void writeCRLF() {
    writeBinary('\r');
    writeBinary('\n');
}

void writeUnsignedByte(uint8_t aByte) {
    char tStringBuffer[4];
    utoa(aByte, tStringBuffer, 10);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

/*
 * 2 Byte Hex output
 */
void writeUnsignedByteHex(uint8_t aByte) {
    char tStringBuffer[3];
    //    tStringBuffer[0] = nibbleToHex(aByte >> 4);
    //    tStringBuffer[1] = nibbleToHex(aByte);
    //    tStringBuffer[2] = '\0';
    // the utoa() version is 8 bytes smaller than the version with nibbleToHex(), if utoa() is allocated by another function.
    utoa(aByte, &tStringBuffer[0], 16);
    if (tStringBuffer[1] == '\0') {
        tStringBuffer[2] = '\0';
        tStringBuffer[1] = tStringBuffer[0];
        tStringBuffer[0] = '0';
    }
    writeString(tStringBuffer);
}

/*
 * 2 Byte Hex output with 2 Byte prefix "0x"
 */
void writeUnsignedByteHexWithPrefix(uint8_t aByte) {
    writeBinary('0');
    writeBinary('x');
    writeUnsignedByteHex(aByte);
}

char nibbleToHex(uint8_t aByte) {
    aByte = aByte & 0x0F;
    if (aByte < 10) {
        return aByte + '0';
    }
    return aByte + 'A' - 10;
}

void writeByte(int8_t aByte) {
    char tStringBuffer[5];
    itoa(aByte, tStringBuffer, 10);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void writeInt(int16_t aInteger) {
    char tStringBuffer[7];
    itoa(aInteger, tStringBuffer, 10);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void writeUnsignedInt(uint16_t aInteger) {
    char tStringBuffer[6];
    utoa(aInteger, tStringBuffer, 10);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void writeLong(int32_t aLong) {
    char tStringBuffer[12];
    ltoa(aLong, tStringBuffer, 10);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void writeUnsignedLong(uint32_t aLong) {
    char tStringBuffer[11];
    ultoa(aLong, tStringBuffer, 10);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void writeFloat(double aFloat) {
    char tStringBuffer[11];
    dtostrf(aFloat, 10, 3, tStringBuffer);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void writeFloat(double aFloat, uint8_t aDigits) {
    char tStringBuffer[11];
    dtostrf(aFloat, 10, aDigits, tStringBuffer);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

/******************************************************
 * The TinySerialOut class functions which implements
 * the Serial + printHex() and printlnHex() functions
 ******************************************************/
/*
 * An alternative way to call the init function :-)
 */
void TinySerialOut::begin(long aBaudrate) {
    initTXPin();
#if defined(USE_115200BAUD) // else smaller code, but only 38400 baud at 1 MHz
    if (aBaudrate != 115200) {
        println(F("Only 115200 supported!"));
    }
#else
#if (F_CPU == 1000000)
    if (aBaudrate != 38400) {
        println(F("Only 38400 supported!"));
    }
#else
    if (aBaudrate != 230400) {
        println(F("Only 230400 supported!"));
    }
#endif
#endif
}

void TinySerialOut::end() {
    // no action needed
}

void TinySerialOut::flush() {
    // no action needed, since we do not use a buffer
}

/*
 * 2 Byte Hex output with 2 Byte prefix "0x"
 */
void TinySerialOut::printHex(uint8_t aByte) {
    writeUnsignedByteHexWithPrefix(aByte);
}

void TinySerialOut::printHex(uint16_t aWord) {
    writeUnsignedByteHexWithPrefix(aWord >> 8);
    writeUnsignedByteHex(aWord);
}

void TinySerialOut::printlnHex(uint8_t aByte) {
    printHex(aByte);
    println();
}

void TinySerialOut::printlnHex(uint16_t aWord) {
    printHex(aWord);
    println();
}

// virtual functions of Print class
size_t TinySerialOut::write(uint8_t aByte) {
    writeBinary(aByte);
    return 1;
}

void TinySerialOut::print(const char *aStringPtr) {
    writeString(aStringPtr);
}

void TinySerialOut::print(const __FlashStringHelper *aStringPtr) {
    writeString(aStringPtr);
}

void TinySerialOut::print(char aChar) {
    writeBinary(aChar);
}

void TinySerialOut::print(uint8_t aByte, uint8_t aBase) {
    if (aBase == 16) {
        /*
         * Print Hex always with two characters
         */
        writeUnsignedByteHex(aByte);
    } else {
        char tStringBuffer[4];
        utoa(aByte, tStringBuffer, aBase);
        writeStringSkipLeadingSpaces(tStringBuffer);
    }
}

void TinySerialOut::print(int16_t aInteger, uint8_t aBase) {
    char tStringBuffer[7];
    itoa(aInteger, tStringBuffer, aBase);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void TinySerialOut::print(uint16_t aInteger, uint8_t aBase) {
    char tStringBuffer[6];
    utoa(aInteger, tStringBuffer, aBase);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void TinySerialOut::print(int32_t aLong, uint8_t aBase) {
    char tStringBuffer[12];
    ltoa(aLong, tStringBuffer, aBase);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void TinySerialOut::print(uint32_t aLong, uint8_t aBase) {
    char tStringBuffer[11];
    ultoa(aLong, tStringBuffer, aBase);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void TinySerialOut::print(double aFloat, uint8_t aDigits) {
    char tStringBuffer[11];
    dtostrf(aFloat, 10, aDigits, tStringBuffer);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void TinySerialOut::println(char aChar) {
    print(aChar);
    println();
}

void TinySerialOut::println(const char *aStringPtr) {
    print(aStringPtr);
    println();
}

void TinySerialOut::println(const __FlashStringHelper *aStringPtr) {
    print(aStringPtr);
    println();
}

void TinySerialOut::println(uint8_t aByte, uint8_t aBase) {
    print(aByte, aBase);
    println();
}

void TinySerialOut::println(int16_t aInteger, uint8_t aBase) {
    print(aInteger, aBase);
    println();
}

void TinySerialOut::println(uint16_t aInteger, uint8_t aBase) {
    print(aInteger, aBase);
    println();
}

void TinySerialOut::println(int32_t aLong, uint8_t aBase) {
    print(aLong, aBase);
    println();
}

void TinySerialOut::println(uint32_t aLong, uint8_t aBase) {
    print(aLong, aBase);
    println();
}

void TinySerialOut::println(double aFloat, uint8_t aDigits) {
    print(aFloat, aDigits);
    println();
}

void TinySerialOut::println() {
    print('\r');
    print('\n');
}

