arendst/Tasmota/lib/lib_div/IRMP-3.4.0/examples/OneProtocol/ATtinySerialOut.cpp
            "nop" "\n\t" /* 1 */
            "nop" "\n\t" /* 1 */

            "nop" "\n\t" /* 1 */
            "nop" "\n\t" /* 1 */
            "sbi   %[txport], %[txpin]" "\n\t" /* 2  <--- b7 is 9 cycles */
            "nop" "\n\t" /* 1 */
            "nop" "\n\t" /* 1 */
            "nop" "\n\t" /* 1 */
            "nop" "\n\t" /* 1 */
            "nop" "\n\t" /* 1 */
            "nop" "\n\t" /* 1 */
            "nop" "\n\t" /* 1 */
            /*    <---sp is 9 cycles */

            :
            :
            [value] "r" ( aValue ),
            [txport] "I" ( TX_PORT_ADDR ),
            [txpin] "I" ( TX_PIN )
    );
}
#else
/*
 * Small code using loop. Code size is 76 Byte (including first call)
 *
 * 1 MHz CPU Clock
 *  26,04 cycles per bit, 260,4 per byte for 38400 baud at 1 MHz Clock
 *  17,36 cycles per bit, 173,6 per byte for 57600 baud at 1 MHz Clock -> therefore use 38400 baud
 *  24 cycles between each cbi/sbi (Clear/Set Bit in IO-register) command.
 *
 * 8 MHz CPU Clock
 *  69,44 cycles per bit, 694,4 per byte for 115200 baud at 8 MHz Clock
 *  34,72 cycles per bit, 347,2 per byte for 230400 baud at 8 MHz Clock.
 *  68 / 33 cycles between each cbi (Clear Bit in IO-register) or sbi command.
 *
 * 16 MHz CPU Clock
 *  138,88 cycles per bit, 1388,8 per byte for 115200 baud at 16 MHz Clock
 *  69,44 cycles per bit, 694,4 per byte for 230400 baud at 16 MHz Clock
 *  137 / 68 cycles between each cbi (Clear Bit in IO-register) or sbi command.
 *
 * 2 cycles for each cbi/sbi instruction.
 */
void write1Start8Data1StopNoParity(uint8_t aValue) {
    asm volatile
    (
            "cbi  %[txport] , %[txpin]" "\n\t" // 2    PORTB &= ~(1 << TX_PIN);
#if (F_CPU == 1000000) && !defined(USE_115200BAUD) // 1 MHz 38400 baud
            // 0 cycles padding to get additional 4 cycles
            //delay4CyclesInlineExact(5); -> 20 cycles
            "ldi  r30 , 0x05" "\n\t"// 1
#elif ((F_CPU == 8000000) && defined(USE_115200BAUD)) || ((F_CPU == 16000000) && !defined(USE_115200BAUD)) // 8 MHz 115200 baud OR 16 MHz 230400 baud
            // 3 cycles padding to get additional 7 cycles
            "nop" "\n\t"// 1    _nop"();
            "nop" "\n\t"// 1    _nop"();
            "nop" "\n\t"// 1    _nop"();
            //delay4CyclesInlineExact(15); -> 61 cycles
            "ldi  r30 , 0x0F" "\n\t"// 1
#elif (F_CPU == 8000000) && !defined(USE_115200BAUD) // 8 MHz 230400 baud
            // 0 cycles padding to get additional 4 cycles
            //delay4CyclesInlineExact(7); -> 29 cycles
            "ldi  r30 , 0x07" "\n\t"// 1
#elif (F_CPU == 16000000) && defined(USE_115200BAUD) // 16 MHz 115200 baud
            // 0 cycles padding to get additional 4 cycles
            //delay4CyclesInlineExact(33); -> 133 cycles
            "ldi  r30 , 0x21" "\n\t"// 1
#endif
            "ldi  r31 , 0x00" "\n\t"            // 1
            "delay1:"
            "sbiw r30 , 0x01" "\n\t"// 2
            "brne delay1" "\n\t"// 1-2

            "ldi r25 , 0x08" "\n\t"// 1

            // Start of loop
            // if (aValue & 0x01) {
            "txloop:"
            "sbrs %[value] , 0" "\n\t"// 1
            "rjmp .+6" "\n\t"// 2

            "nop" "\n\t"// 1
            "sbi %[txport] , %[txpin]" "\n\t"// 2    PORTB |= 1 << TX_PIN;
            "rjmp .+6" "\n\t"// 2

            "cbi %[txport] , %[txpin]" "\n\t"// 2    PORTB &= ~(1 << TX_PIN);
            "nop" "\n\t"// 1
            "nop" "\n\t"// 1
            "lsr %[value]" "\n\t"// 1    aValue = aValue >> 1;

#if (F_CPU == 1000000) && !defined(USE_115200BAUD) // 1 MHz 38400 baud
            // 3 cycles padding to get additional 11 cycles
            "nop" "\n\t"// 1
            "nop" "\n\t"// 1
            "nop" "\n\t"// 1
            // delay4CyclesInlineExact(3); -> 13 cycles
            "ldi  r30 , 0x03" "\n\t"// 1
#elif ((F_CPU == 8000000) && defined(USE_115200BAUD)) || ((F_CPU == 16000000) && !defined(USE_115200BAUD)) // 8 MHz 115200 baud OR 16 MHz 230400 baud
            // 3 cycles padding to get additional 11 cycles
            "nop" "\n\t"// 1
            "nop" "\n\t"// 1
            "nop" "\n\t"// 1
            // delay4CyclesInlineExact(14); -> 57 cycles
            "ldi r30 , 0x0E" "\n\t"// 1
#elif (F_CPU == 8000000) && !defined(USE_115200BAUD) // 8 MHz 230400 baud
            // 0 cycles padding to get additional 8 cycles
            // delay4CyclesInlineExact(6); -> 25 cycles
            "ldi r30 , 0x05" "\n\t"// 1
#elif (F_CPU == 16000000) && defined(USE_115200BAUD) // 16 MHz 115200 baud
            // 0 cycles padding to get additional 8 cycles
            //delay4CyclesInlineExact(32); -> 129 cycles
            "ldi  r30 , 0x20" "\n\t"// 1
#endif
            "ldi r31 , 0x00" "\n\t"            // 1
            "delay2:"
            "sbiw r30 , 0x01" "\n\t"// 2
            "brne delay2" "\n\t"// 1-2

            // }while (i > 0);
            "subi r25 , 0x01" "\n\t"// 1
            "brne txloop" "\n\t"// 1-2
            // To compensate for missing loop cycles at last bit
            "nop" "\n\t"// 1
            "nop" "\n\t"// 1
            "nop" "\n\t"// 1
            "nop" "\n\t"// 1

            // Stop bit
            "sbi %[txport] , %[txpin]" "\n\t"// 2    PORTB |= 1 << TX_PIN;

#if (F_CPU == 1000000) && !defined(USE_115200BAUD) // 1 MHz 38400 baud
            // delay4CyclesInlineExact(4); -> 17 cycles - gives minimum 25 cycles for stop bit
            "ldi  r30 , 0x04" "\n\t"// 1
#elif ((F_CPU == 8000000) && defined(USE_115200BAUD)) || ((F_CPU == 16000000) && !defined(USE_115200BAUD)) // 8 MHz 115200 baud OR 16 MHz 230400 baud
            // delay4CyclesInlineExact(15) -> 61 cycles - gives minimum 69 cycles for stop bit
            "ldi r30 , 0x0F" "\n\t"// 1
#elif (F_CPU == 8000000) && !defined(USE_115200BAUD) // 8 MHz 230400 baud
            // delay4CyclesInlineExact(5) -> 27 cycles - gives minimum 35 cycles for stop bit
            "ldi r30 , 0x05" "\n\t"// 1
#elif (F_CPU == 16000000) && defined(USE_115200BAUD) // 16 MHz 115200 baud
            // delay4CyclesInlineExact(32) -> 129 cycles - gives minimum 137 cycles for stop bit
            "ldi r30 , 0x20" "\n\t"// 1
#endif
            "ldi r31 , 0x00" "\n\t"            // 1
            "delay3:"
            "sbiw r30 , 0x01" "\n\t"//
            "brne delay3" "\n\t"// 1-2
            // return needs 4 cycles, load of next value needs 1 cycle, next rcall needs 3 cycles -> gives additional 8 cycles minimum for stop bit

            :
            :
            [value] "r" ( aValue ),
            [txport] "I" ( TX_PORT_ADDR ) , /* 0x18 is PORTB on Attiny 85 */
            [txpin] "I" ( TX_PIN )
            :
            "r25",
            "r30",
            "r31"
    );

